#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/lambda_ec2_start/main.tf line 21, in resource "aws_lambda_function" "this":
  21: resource "aws_lambda_function" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute last_modified is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.archive_file.lambda_ec2_start: Reading...[0m[0m
[0m[1mdata.archive_file.lambda_ec2_stop: Reading...[0m[0m
[0m[1mdata.archive_file.lambda_ec2_start: Read complete after 0s [id=5645c2aa6153bf85e721897c6337a69c9641c9f7][0m
[0m[1mdata.archive_file.lambda_ec2_stop: Read complete after 0s [id=a077de9d776d2800cdb162e2d601bb05a8af9eb2][0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_caller_identity.default: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_stop.data.aws_region.this[0]: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_stop.data.aws_partition.this[0]: Reading...[0m[0m
[0m[1mmodule.ec2_ftps.data.aws_caller_identity.default: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.aws_backup_assume_policy: Reading...[0m[0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.opted_in: Reading...[0m[0m
[0m[1mdata.aws_iam_policy.AWSBackupServiceRolePolicyForBackup: Reading...[0m[0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_region.default: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_start.data.aws_caller_identity.this[0]: Reading...[0m[0m
[0m[1mmodule.ec2_windows_smb.data.aws_region.default: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_stop.data.aws_partition.this[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.lambda_ec2_stop.data.aws_region.this[0]: Read complete after 0s [id=eu-west-2][0m
[0m[1mmodule.ec2_windows_smb.data.aws_region.default: Read complete after 0s [id=eu-west-2][0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_region.default: Read complete after 0s [id=eu-west-2][0m
[0m[1mmodule.ec2_windows_smb.data.aws_partition.default: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_start.data.aws_region.this[0]: Reading...[0m[0m
[0m[1mdata.aws_iam_policy.AWSBackupServiceRolePolicyForRestores: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_start.data.aws_region.this[0]: Read complete after 0s [id=eu-west-2][0m
[0m[1mmodule.ec2_windows_smb.data.aws_partition.default: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.aws_backup_assume_policy: Read complete after 0s [id=1497918837][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.complete: Reading...[0m[0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_iam_policy_document.default: Reading...[0m[0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Reading...[0m[0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_iam_policy_document.default: Read complete after 0s [id=2851119427][0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_partition.default: Reading...[0m[0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_partition.default: Read complete after 0s [id=aws][0m
[0m[1mmodule.lambda_ec2_start.data.aws_partition.this[0]: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_start.data.aws_partition.this[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.ec2_ftps.data.aws_region.default: Reading...[0m[0m
[0m[1mmodule.ec2_windows_smb.data.aws_caller_identity.default: Reading...[0m[0m
[0m[1mmodule.ec2_ftps.data.aws_region.default: Read complete after 0s [id=eu-west-2][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.default: Reading...[0m[0m
[0m[1mmodule.ec2_ftps.data.aws_caller_identity.default: Read complete after 0s [id=517553980935][0m
[0m[1mmodule.lambda_ec2_start.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_start.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.dynamic_subnets.data.aws_availability_zones.default[0]: Reading...[0m[0m
[0m[1mdata.aws_iam_policy.AWSBackupServiceRolePolicyForBackup: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup][0m
[0m[1mmodule.lambda_ec2_stop.data.aws_caller_identity.this[0]: Reading...[0m[0m
[0m[1mmodule.ec2_wireguard_vpn.data.aws_caller_identity.default: Read complete after 0s [id=517553980935][0m
[0m[1mmodule.lambda_ec2_stop.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.lambda_ec2_stop.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.ec2_ftps.data.aws_partition.default: Reading...[0m[0m
[0m[1mmodule.ec2_ftps.data.aws_partition.default: Read complete after 0s [id=aws][0m
[0m[1mmodule.ec2_ftps.data.aws_iam_policy_document.default: Reading...[0m[0m
[0m[1mmodule.ec2_ftps.data.aws_iam_policy_document.default: Read complete after 0s [id=2851119427][0m
[0m[1mmodule.ec2_windows_smb.data.aws_iam_policy_document.default: Reading...[0m[0m
[0m[1mmodule.ec2_windows_smb.data.aws_iam_policy_document.default: Read complete after 0s [id=2851119427][0m
[0m[1mdata.aws_iam_policy.AWSBackupServiceRolePolicyForRestores: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores][0m
[0m[1mmodule.lambda_ec2_start.data.aws_caller_identity.this[0]: Read complete after 0s [id=517553980935][0m
[0m[1mmodule.ec2_windows_smb.data.aws_caller_identity.default: Read complete after 0s [id=517553980935][0m
[0m[1mmodule.lambda_ec2_stop.data.aws_caller_identity.this[0]: Read complete after 0s [id=517553980935][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Read complete after 0s [id=aws][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.opted_in: Read complete after 0s [id=aws][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.complete: Read complete after 0s [id=aws][0m
[0m[1mmodule.dynamic_subnets.module.utils.data.aws_regions.default: Read complete after 0s [id=aws][0m
[0m[1mmodule.dynamic_subnets.data.aws_availability_zones.default[0]: Read complete after 0s [id=eu-west-2][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_iam_policy_document.lambda_ec2[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "lambda_ec2" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m "arn:aws:logs:eu-west-2:339712908298:*",
            ]
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "ec2:Start*",
              [32m+[0m[0m "ec2:Stop*",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
              [32m+[0m[0m (known after apply),
              [32m+[0m[0m (known after apply),
            ]
        }
    }

[1m  # aws_backup_plan.backup_plan_ec2_without_copy[0m will be created
[0m  [32m+[0m[0m resource "aws_backup_plan" "backup_plan_ec2_without_copy" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m name     = "envoy-associates-prod2-smb-plan-ec2"
      [32m+[0m[0m tags_all = (known after apply)
      [32m+[0m[0m version  = (known after apply)

      [32m+[0m[0m rule {
          [32m+[0m[0m completion_window            = 120
          [32m+[0m[0m enable_continuous_backup     = false
          [32m+[0m[0m recovery_point_tags          = {
              [32m+[0m[0m "Creator" = "aws-backup"
              [32m+[0m[0m "Product" = "envoy-associates"
              [32m+[0m[0m "Role"    = "envoy-associates-prod2-smb-awsbackup-role"
            }
          [32m+[0m[0m rule_name                    = "envoy-associates-prod2-smb-daily"
          [32m+[0m[0m schedule                     = "cron(0 2 ? * SUN-SAT *)"
          [32m+[0m[0m schedule_expression_timezone = "Etc/UTC"
          [32m+[0m[0m start_window                 = 60
          [32m+[0m[0m target_vault_name            = "envoy-associates-prod2-smb-vault"

          [32m+[0m[0m lifecycle {
              [32m+[0m[0m delete_after                              = 14
              [32m+[0m[0m opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

[1m  # aws_backup_selection.ec2-backup-selection_without_copy[0m will be created
[0m  [32m+[0m[0m resource "aws_backup_selection" "ec2-backup-selection_without_copy" {
      [32m+[0m[0m iam_role_arn  = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m name          = "envoy-associates-prod2-smb-server-resources"
      [32m+[0m[0m not_resources = [
          [32m+[0m[0m "arn:aws:ec2:eu-west-2:339712908298:volume/vol-*",
        ]
      [32m+[0m[0m plan_id       = (known after apply)

      [32m+[0m[0m condition {
          [32m+[0m[0m string_like {
              [32m+[0m[0m key   = "aws:ResourceTag/Stage"
              [32m+[0m[0m value = "prod2"
            }
        }

      [32m+[0m[0m selection_tag {
          [32m+[0m[0m key   = "Backup"
          [32m+[0m[0m type  = "STRINGEQUALS"
          [32m+[0m[0m value = "true"
        }
    }

[1m  # aws_backup_vault.backup_vault[0m will be created
[0m  [32m+[0m[0m resource "aws_backup_vault" "backup_vault" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m force_destroy   = false
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m kms_key_arn     = "arn:aws:kms:eu-west-2:339712908298:key/945914c6-dcf1-4ca0-8a2f-ae0d7e4dae28"
      [32m+[0m[0m name            = "envoy-associates-prod2-smb-vault"
      [32m+[0m[0m recovery_points = (known after apply)
      [32m+[0m[0m tags_all        = (known after apply)
    }

[1m  # aws_cloudwatch_event_rule.ec2_weekday_start[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "ec2_weekday_start" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m event_bus_name      = "default"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "weekday-schedule-envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m name_prefix         = (known after apply)
      [32m+[0m[0m schedule_expression = "cron(0 6 ? * MON-FRI *)"
      [32m+[0m[0m tags_all            = (known after apply)
    }

[1m  # aws_cloudwatch_event_rule.ec2_weekday_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "ec2_weekday_stop" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m event_bus_name      = "default"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "weekday-schedule-envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m name_prefix         = (known after apply)
      [32m+[0m[0m schedule_expression = "cron(0 18 ? * MON-SUN *)"
      [32m+[0m[0m tags_all            = (known after apply)
    }

[1m  # aws_cloudwatch_event_rule.ec2_weekend_start[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "ec2_weekend_start" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m event_bus_name      = "default"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "weekend-schedule-envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m name_prefix         = (known after apply)
      [32m+[0m[0m schedule_expression = "cron(0 8 ? * SAT *)"
      [32m+[0m[0m tags_all            = (known after apply)
    }

[1m  # aws_cloudwatch_event_rule.ec2_weekend_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "ec2_weekend_stop" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m event_bus_name      = "default"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "weekend-schedule-envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m name_prefix         = (known after apply)
      [32m+[0m[0m schedule_expression = "cron(0 12 ? * SAT *)"
      [32m+[0m[0m tags_all            = (known after apply)
    }

[1m  # aws_cloudwatch_event_target.ec2_weekday_start[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "ec2_weekday_start" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m force_destroy  = false
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "weekday-schedule-envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m target_id      = "event-target-envoy-associates-prod2-smb-lambda-ec2-start"
    }

[1m  # aws_cloudwatch_event_target.ec2_weekday_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "ec2_weekday_stop" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m force_destroy  = false
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "weekday-schedule-envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m target_id      = "event-target-envoy-associates-prod2-smb-lambda-ec2-stop"
    }

[1m  # aws_cloudwatch_event_target.ec2_weekend_start[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "ec2_weekend_start" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m force_destroy  = false
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "weekend-schedule-envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m target_id      = "event-target-envoy-associates-prod2-smb-lambda-ec2-start"
    }

[1m  # aws_cloudwatch_event_target.ec2_weekend_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "ec2_weekend_stop" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m force_destroy  = false
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "weekend-schedule-envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m target_id      = "event-target-envoy-associates-prod2-smb-lambda-ec2-stop"
    }

[1m  # aws_iam_role.aws_backup_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "aws_backup_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "backup.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-awsbackup-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy.lambda_ec2_start[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "lambda_ec2_start" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = (known after apply)
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m role        = "envoy-associates-prod2-smb-lambda-ec2-start-eu-west-2"
    }

[1m  # aws_iam_role_policy.lambda_ec2_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "lambda_ec2_stop" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = (known after apply)
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m role        = "envoy-associates-prod2-smb-lambda-ec2-stop-eu-west-2"
    }

[1m  # aws_iam_role_policy_attachment.AWSBackupServiceRolePolicyForBackup[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "AWSBackupServiceRolePolicyForBackup" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-awsbackup-role"
    }

[1m  # aws_iam_role_policy_attachment.AWSBackupServiceRolePolicyForRestores[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "AWSBackupServiceRolePolicyForRestores" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-awsbackup-role"
    }

[1m  # aws_lambda_permission.ec2_weekday_start[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "ec2_weekday_start" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "events.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_lambda_permission.ec2_weekday_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "ec2_weekday_stop" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "events.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_lambda_permission.ec2_weekend_start[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "ec2_weekend_start" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "events.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_lambda_permission.ec2_weekend_stop[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "ec2_weekend_stop" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "events.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.dynamic_subnets.data.aws_vpc.default[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_vpc" "default" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = (known after apply)
      [32m+[0m[0m cidr_block_associations              = (known after apply)
      [32m+[0m[0m default                              = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = (known after apply)
      [32m+[0m[0m enable_dns_support                   = (known after apply)
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = (known after apply)
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m state                                = (known after apply)
      [32m+[0m[0m tags                                 = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_network_acl.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl" "private" {
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m egress     = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ingress    = (known after apply)
      [32m+[0m[0m owner_id   = (known after apply)
      [32m+[0m[0m subnet_ids = (known after apply)
      [32m+[0m[0m tags       = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all   = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id     = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_network_acl.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl" "public" {
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m egress     = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ingress    = (known after apply)
      [32m+[0m[0m owner_id   = (known after apply)
      [32m+[0m[0m subnet_ids = (known after apply)
      [32m+[0m[0m tags       = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all   = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id     = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_network_acl_rule.private4_egress[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private4_egress" {
      [32m+[0m[0m cidr_block     = "0.0.0.0/0"
      [32m+[0m[0m egress         = true
      [32m+[0m[0m from_port      = 0
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m network_acl_id = (known after apply)
      [32m+[0m[0m protocol       = "-1"
      [32m+[0m[0m rule_action    = "allow"
      [32m+[0m[0m rule_number    = 100
      [32m+[0m[0m to_port        = 0
    }

[1m  # module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private4_ingress" {
      [32m+[0m[0m cidr_block     = "0.0.0.0/0"
      [32m+[0m[0m egress         = false
      [32m+[0m[0m from_port      = 0
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m network_acl_id = (known after apply)
      [32m+[0m[0m protocol       = "-1"
      [32m+[0m[0m rule_action    = "allow"
      [32m+[0m[0m rule_number    = 100
      [32m+[0m[0m to_port        = 0
    }

[1m  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public4_egress" {
      [32m+[0m[0m cidr_block     = "0.0.0.0/0"
      [32m+[0m[0m egress         = true
      [32m+[0m[0m from_port      = 0
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m network_acl_id = (known after apply)
      [32m+[0m[0m protocol       = "-1"
      [32m+[0m[0m rule_action    = "allow"
      [32m+[0m[0m rule_number    = 100
      [32m+[0m[0m to_port        = 0
    }

[1m  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0][0m will be created
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public4_ingress" {
      [32m+[0m[0m cidr_block     = "0.0.0.0/0"
      [32m+[0m[0m egress         = false
      [32m+[0m[0m from_port      = 0
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m network_acl_id = (known after apply)
      [32m+[0m[0m protocol       = "-1"
      [32m+[0m[0m rule_action    = "allow"
      [32m+[0m[0m rule_number    = 100
      [32m+[0m[0m to_port        = 0
    }

[1m  # module.dynamic_subnets.aws_route.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "public" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m gateway_id             = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_route_table.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table.private[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.private[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_route_table_association.public[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dynamic_subnets.aws_subnet.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_subnet.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_subnet.private[2][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "private"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-private-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2a"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_subnet.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2b"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.dynamic_subnets.aws_subnet.public[2][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = "ip-name"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Attributes" = "public"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-public-euw2c"
          [32m+[0m[0m "Namespace"  = "envoy-associates"
          [32m+[0m[0m "Stage"      = "prod2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.ec2_ftps.data.aws_subnet.default[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_subnet" "default" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = (known after apply)
      [32m+[0m[0m availability_zone                              = (known after apply)
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m available_ip_address_count                     = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m customer_owned_ipv4_pool                       = (known after apply)
      [32m+[0m[0m default_for_az                                 = (known after apply)
      [32m+[0m[0m enable_dns64                                   = (known after apply)
      [32m+[0m[0m enable_lni_at_device_index                     = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                                = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = (known after apply)
      [32m+[0m[0m map_customer_owned_ip_on_launch                = (known after apply)
      [32m+[0m[0m map_public_ip_on_launch                        = (known after apply)
      [32m+[0m[0m outpost_arn                                    = (known after apply)
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m state                                          = (known after apply)
      [32m+[0m[0m tags                                           = (known after apply)
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.ec2_ftps.aws_eip.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "default" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.ec2_ftps.aws_iam_instance_profile.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "default" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "envoy-associates-prod2-smb-ftps-server"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "envoy-associates-prod2-smb-ftps-server"
      [32m+[0m[0m tags        = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.ec2_ftps.aws_iam_role.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "default" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-ftps-server"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ec2_ftps.aws_iam_role_policy_attachment.ssm_core[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ssm_core" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-ftps-server"
    }

[1m  # module.ec2_ftps.aws_instance.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "default" {
      [32m+[0m[0m ami                                  = "ami-0634f20aa0764d177"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = false
      [32m+[0m[0m disable_api_termination              = false
      [32m+[0m[0m ebs_optimized                        = true
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "envoy-associates-prod2-smb-ftps-server"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3.micro"
      [32m+[0m[0m ipv6_address_count                   = 0
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "EnvoyAssociatesProd2Key"
      [32m+[0m[0m monitoring                           = true
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = "10.1.0.113"
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tenancy                              = "default"
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m volume_tags                          = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-ftps-server"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m credit_specification {}

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = "disabled"
        }

      [32m+[0m[0m root_block_device {
          [32m+[0m[0m delete_on_termination = true
          [32m+[0m[0m device_name           = (known after apply)
          [32m+[0m[0m encrypted             = true
          [32m+[0m[0m iops                  = 3000
          [32m+[0m[0m kms_key_id            = (known after apply)
          [32m+[0m[0m tags_all              = (known after apply)
          [32m+[0m[0m throughput            = 125
          [32m+[0m[0m volume_id             = (known after apply)
          [32m+[0m[0m volume_size           = 8
          [32m+[0m[0m volume_type           = "gp3"
        }
    }

[1m  # module.ec2_windows_smb.data.aws_subnet.default[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_subnet" "default" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = (known after apply)
      [32m+[0m[0m availability_zone                              = (known after apply)
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m available_ip_address_count                     = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m customer_owned_ipv4_pool                       = (known after apply)
      [32m+[0m[0m default_for_az                                 = (known after apply)
      [32m+[0m[0m enable_dns64                                   = (known after apply)
      [32m+[0m[0m enable_lni_at_device_index                     = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                                = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = (known after apply)
      [32m+[0m[0m map_customer_owned_ip_on_launch                = (known after apply)
      [32m+[0m[0m map_public_ip_on_launch                        = (known after apply)
      [32m+[0m[0m outpost_arn                                    = (known after apply)
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m state                                          = (known after apply)
      [32m+[0m[0m tags                                           = (known after apply)
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.ec2_windows_smb.aws_ebs_volume.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ebs_volume" "default" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m availability_zone = (known after apply)
      [32m+[0m[0m create_time       = (known after apply)
      [32m+[0m[0m encrypted         = true
      [32m+[0m[0m final_snapshot    = false
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m iops              = 3000
      [32m+[0m[0m kms_key_id        = (known after apply)
      [32m+[0m[0m size              = 300
      [32m+[0m[0m snapshot_id       = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m throughput        = 125
      [32m+[0m[0m type              = "gp3"
    }

[1m  # module.ec2_windows_smb.aws_iam_instance_profile.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "default" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "envoy-associates-prod2-smb-windows-fileserver"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "envoy-associates-prod2-smb-windows-fileserver"
      [32m+[0m[0m tags        = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.ec2_windows_smb.aws_iam_role.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "default" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-windows-fileserver"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ec2_windows_smb.aws_iam_role_policy_attachment.ssm_core[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ssm_core" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-windows-fileserver"
    }

[1m  # module.ec2_windows_smb.aws_instance.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "default" {
      [32m+[0m[0m ami                                  = "ami-0137a390af578b3e9"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = false
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = false
      [32m+[0m[0m disable_api_termination              = false
      [32m+[0m[0m ebs_optimized                        = true
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "envoy-associates-prod2-smb-windows-fileserver"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3a.medium"
      [32m+[0m[0m ipv6_address_count                   = 0
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "EnvoyAssociatesProd2Key"
      [32m+[0m[0m monitoring                           = true
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = "10.1.0.12"
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tenancy                              = "default"
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m volume_tags                          = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-windows-fileserver"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m credit_specification {}

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = "disabled"
        }

      [32m+[0m[0m root_block_device {
          [32m+[0m[0m delete_on_termination = true
          [32m+[0m[0m device_name           = (known after apply)
          [32m+[0m[0m encrypted             = true
          [32m+[0m[0m iops                  = 3000
          [32m+[0m[0m kms_key_id            = (known after apply)
          [32m+[0m[0m tags_all              = (known after apply)
          [32m+[0m[0m throughput            = 125
          [32m+[0m[0m volume_id             = (known after apply)
          [32m+[0m[0m volume_size           = 40
          [32m+[0m[0m volume_type           = "gp3"
        }
    }

[1m  # module.ec2_windows_smb.aws_volume_attachment.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_volume_attachment" "default" {
      [32m+[0m[0m device_name                    = "/dev/xvdb"
      [32m+[0m[0m force_detach                   = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m instance_id                    = (known after apply)
      [32m+[0m[0m stop_instance_before_detaching = false
      [32m+[0m[0m volume_id                      = (known after apply)
    }

[1m  # module.ec2_wireguard_vpn.data.aws_subnet.default[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_subnet" "default" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = (known after apply)
      [32m+[0m[0m availability_zone                              = (known after apply)
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m available_ip_address_count                     = (known after apply)
      [32m+[0m[0m cidr_block                                     = (known after apply)
      [32m+[0m[0m customer_owned_ipv4_pool                       = (known after apply)
      [32m+[0m[0m default_for_az                                 = (known after apply)
      [32m+[0m[0m enable_dns64                                   = (known after apply)
      [32m+[0m[0m enable_lni_at_device_index                     = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = (known after apply)
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                                = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = (known after apply)
      [32m+[0m[0m map_customer_owned_ip_on_launch                = (known after apply)
      [32m+[0m[0m map_public_ip_on_launch                        = (known after apply)
      [32m+[0m[0m outpost_arn                                    = (known after apply)
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m state                                          = (known after apply)
      [32m+[0m[0m tags                                           = (known after apply)
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.ec2_wireguard_vpn.aws_eip.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "default" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.ec2_wireguard_vpn.aws_iam_instance_profile.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "default" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "envoy-associates-prod2-smb-wireguard-vpn"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "envoy-associates-prod2-smb-wireguard-vpn"
      [32m+[0m[0m tags        = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.ec2_wireguard_vpn.aws_iam_role.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "default" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-wireguard-vpn"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ec2_wireguard_vpn.aws_iam_role_policy_attachment.ssm_core[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ssm_core" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-wireguard-vpn"
    }

[1m  # module.ec2_wireguard_vpn.aws_instance.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "default" {
      [32m+[0m[0m ami                                  = "ami-06523eeaf4c1ae991"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = false
      [32m+[0m[0m disable_api_termination              = false
      [32m+[0m[0m ebs_optimized                        = true
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "envoy-associates-prod2-smb-wireguard-vpn"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3a.micro"
      [32m+[0m[0m ipv6_address_count                   = 0
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "EnvoyAssociatesProd2Key"
      [32m+[0m[0m monitoring                           = true
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = "10.1.0.112"
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tenancy                              = "default"
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m volume_tags                          = {
          [32m+[0m[0m "Backup"    = "true"
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-wireguard-vpn"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m credit_specification {}

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = "disabled"
        }

      [32m+[0m[0m root_block_device {
          [32m+[0m[0m delete_on_termination = true
          [32m+[0m[0m device_name           = (known after apply)
          [32m+[0m[0m encrypted             = true
          [32m+[0m[0m iops                  = 3000
          [32m+[0m[0m kms_key_id            = (known after apply)
          [32m+[0m[0m tags_all              = (known after apply)
          [32m+[0m[0m throughput            = 125
          [32m+[0m[0m volume_id             = (known after apply)
          [32m+[0m[0m volume_size           = 10
          [32m+[0m[0m volume_type           = "gp3"
        }
    }

[1m  # module.ftps_server_sg.aws_security_group.cbd[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "cbd" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "FTPS Server Security Group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "envoy-associates-prod2-smb-ftps-server-sg-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-ftps-server-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-ftps-server-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-ftps-server-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-ftps-server-sg"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["_allow_all_egress_"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all egress"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["allow_all"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m description              = "Inbound from all resources in this SG"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ephemeral_bj"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "193.200.101.50/32",
        ]
      [32m+[0m[0m description              = "Ephemeral from BJ network"
      [32m+[0m[0m from_port                = 40000
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 50000
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ephemeral_bj_dr"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "194.50.80.180/32",
        ]
      [32m+[0m[0m description              = "Ephemeral from BJ DR network"
      [32m+[0m[0m from_port                = 40000
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 50000
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ephemeral_envoy"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "157.231.92.5/32",
        ]
      [32m+[0m[0m description              = "Ephemeral from Envoy network"
      [32m+[0m[0m from_port                = 40000
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 50000
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ephemeral_gez"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "82.22.173.9/32",
        ]
      [32m+[0m[0m description              = "Ephemeral from Gez network"
      [32m+[0m[0m from_port                = 40000
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 50000
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftp_bj"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "193.200.101.50/32",
        ]
      [32m+[0m[0m description              = "FTP from BJ network"
      [32m+[0m[0m from_port                = 20
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 21
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftp_bj_dr"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "194.50.80.180/32",
        ]
      [32m+[0m[0m description              = "FTP from BJ DR network"
      [32m+[0m[0m from_port                = 20
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 21
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftp_envoy"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "157.231.92.5/32",
        ]
      [32m+[0m[0m description              = "FTP from Envoy network"
      [32m+[0m[0m from_port                = 20
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 21
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftp_gez"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "82.22.173.9/32",
        ]
      [32m+[0m[0m description              = "FTP from Gez network"
      [32m+[0m[0m from_port                = 20
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 21
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftps_bj"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "193.200.101.50/32",
        ]
      [32m+[0m[0m description              = "FTPS from BJ network"
      [32m+[0m[0m from_port                = 990
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 990
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftps_bj_dr"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "194.50.80.180/32",
        ]
      [32m+[0m[0m description              = "FTPS from BJ DR network"
      [32m+[0m[0m from_port                = 990
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 990
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftps_envoy"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "157.231.92.5/32",
        ]
      [32m+[0m[0m description              = "FTPS from Envoy network"
      [32m+[0m[0m from_port                = 990
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 990
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ftps_gez"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "82.22.173.9/32",
        ]
      [32m+[0m[0m description              = "FTPS from Gez network"
      [32m+[0m[0m from_port                = 990
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 990
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.ftps_server_sg.aws_security_group_rule.dbc["ssh_gr_home"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "82.22.173.9/32",
        ]
      [32m+[0m[0m description              = "SSH from GR home"
      [32m+[0m[0m from_port                = 22
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 22
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.kms_cmk_ebs.aws_kms_alias.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_alias" "default" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m name           = "alias/envoy-associates-prod2-smb-kms-cmk-ebs"
      [32m+[0m[0m name_prefix    = (known after apply)
      [32m+[0m[0m target_key_arn = (known after apply)
      [32m+[0m[0m target_key_id  = (known after apply)
    }

[1m  # module.kms_cmk_ebs.aws_kms_key.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "default" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m deletion_window_in_days            = 10
      [32m+[0m[0m description                        = "KMS key for EBS encyption"
      [32m+[0m[0m enable_key_rotation                = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = false
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m rotation_period_in_days            = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-kms-cmk-ebs"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-kms-cmk-ebs"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
    }

[1m  # module.lambda_ec2_start.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-lambda-ec2-start-eu-west-2"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.lambda_ec2_start.aws_iam_role_policy_attachment.cloudwatch_logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cloudwatch_logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-lambda-ec2-start-eu-west-2"
    }

[1m  # module.lambda_ec2_start.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "Lambda function that starts EC2 instances based on schedule"
      [32m+[0m[0m filename                       = "lambda-ec2-start.zip"
      [32m+[0m[0m function_name                  = "envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m handler                        = "main.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m layers                         = []
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.13"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "rwKN0XX0EhMtlmAPnQrJF6ujW//ZAYWGsPZVRSKoITQ="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = (known after apply)
        }
    }

[1m  # module.lambda_ec2_stop.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "envoy-associates-prod2-smb-lambda-ec2-stop-eu-west-2"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.lambda_ec2_stop.aws_iam_role_policy_attachment.cloudwatch_logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cloudwatch_logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      [32m+[0m[0m role       = "envoy-associates-prod2-smb-lambda-ec2-stop-eu-west-2"
    }

[1m  # module.lambda_ec2_stop.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "Lambda function that stops EC2 instances based on schedule"
      [32m+[0m[0m filename                       = "lambda-ec2-stop.zip"
      [32m+[0m[0m function_name                  = "envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m handler                        = "main.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m layers                         = []
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.13"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "9tm26+kRjobdBI1S/B/g+QcwaJju9paSnLmbfxqj0RE="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = (known after apply)
        }
    }

[1m  # module.vpc.aws_default_security_group.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_security_group" "default" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = (known after apply)
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-default"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb-default"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.vpc.aws_internet_gateway.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "default" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.vpc.aws_vpc.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "default" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m assign_generated_ipv6_cidr_block     = false
      [32m+[0m[0m cidr_block                           = "10.1.0.0/24"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = false
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name"      = "envoy-associates-prod2-smb"
          [32m+[0m[0m "Namespace" = "envoy-associates"
          [32m+[0m[0m "Stage"     = "prod2"
        }
    }

[1m  # module.windows_smb_sg.aws_security_group.cbd[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "cbd" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "SMB File Server Security Group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "envoy-associates-prod2-smb-fileserver-sg-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-fileserver-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-fileserver-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-fileserver-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-fileserver-sg"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.windows_smb_sg.aws_security_group_rule.dbc["_allow_all_egress_"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all egress"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.windows_smb_sg.aws_security_group_rule.dbc["allow_all"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m description              = "Inbound from all resources in this SG"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.windows_smb_sg.aws_security_group_rule.dbc["rdp_vpc"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "10.1.0.0/24",
        ]
      [32m+[0m[0m description              = "RDP from VPC network"
      [32m+[0m[0m from_port                = 3389
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 3389
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.windows_smb_sg.aws_security_group_rule.dbc["smb_vpc"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "10.1.0.0/24",
        ]
      [32m+[0m[0m description              = "SMB from VPC network"
      [32m+[0m[0m from_port                = 445
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 445
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.wireguard_vpn_sg.aws_security_group.cbd[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "cbd" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Wireguard Security Group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "envoy-associates-prod2-smb-wireguard-sg-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-wireguard-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-wireguard-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Attributes" = "envoy-associates-prod2-smb-wireguard-sg"
          [32m+[0m[0m "Name"       = "envoy-associates-prod2-smb-wireguard-sg"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["_allow_all_egress_"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all egress"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["allow_all"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m description              = "Inbound from all resources in this SG"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["smb_envoy"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "192.168.1.0/24",
        ]
      [32m+[0m[0m description              = "SMB from Envoy Office"
      [32m+[0m[0m from_port                = 445
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 445
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["ssh_gr_home"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "82.22.173.9/32",
        ]
      [32m+[0m[0m description              = "SSH from GR home"
      [32m+[0m[0m from_port                = 22
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 22
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["wireguard_envoy"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "dbc" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "157.231.92.5/32",
        ]
      [32m+[0m[0m description              = "Wireguard from Envoy Office"
      [32m+[0m[0m from_port                = 51820
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "udp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 51820
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.lambda_ec2_start.module.cloudwatch_log_group.aws_cloudwatch_log_group.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "default" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-start"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-start"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name" = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-start"
        }
    }

[1m  # module.lambda_ec2_stop.module.cloudwatch_log_group.aws_cloudwatch_log_group.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "default" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-stop"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-stop"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name" = "/aws/lambda/envoy-associates-prod2-smb-lambda-ec2-stop"
        }
    }

[1mPlan:[0m 99 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mRedundant ignore_changes element[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on .terraform/modules/lambda_ec2_start/main.tf line 21, in resource "aws_lambda_function" "this":
[33m│[0m [0m  21: resource [4m"aws_lambda_function"[0m "this" {[0m
[33m│[0m [0m
[33m│[0m [0mAdding an attribute name to ignore_changes tells Terraform to ignore future
[33m│[0m [0mchanges to the argument in configuration after the object has been created,
[33m│[0m [0mretaining the value originally configured.
[33m│[0m [0m
[33m│[0m [0mThe attribute last_modified is decided by the provider alone and therefore
[33m│[0m [0mthere can be no configured value to compare with. Including this attribute
[33m│[0m [0min ignore_changes has no effect. Remove the attribute from ignore_changes
[33m│[0m [0mto quiet this warning.
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gerrardrose, Action: `pull_request`*